Podkova/src/Enums/СтатусыПроверкиНаличияПродукцииИС/СтатусыПроверкиНаличияПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиНаличияПродукцииИС</name>
  <enumValues>
    <name>НеПроверялась</name>
  </enumValues>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>НеЧислилась</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/СтатусыПроверкиИПодбораИС/СтатусыПроверкиИПодбораИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиИПодбораИС</name>
  <enumValues>
    <name>НеВыполнялось</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ДетализацияСтруктурыХраненияИС/ДетализацияСтруктурыХраненияИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДетализацияСтруктурыХраненияИС</name>
  <enumValues>
    <name>Полная</name>
  </enumValues>
  <enumValues>
    <name>ПалетыСМонотоварнымиКоробами</name>
    <comment>Палеты с коробками (до идентификации состава, например по GTIN)</comment>
  </enumValues>
  <enumValues>
    <name>КоробаСГрупповымиУпаковками</name>
    <comment>Короба с бутылками (ЕГАИС), короба с потребительскими упаковками (ИСМП), коробки с блоками (МОТП)</comment>
  </enumValues>
  <enumValues>
    <name>ГрупповыеУпаковки</name>
    <comment>Бутылки, потребительские упаковки (ИСМП), пачки (МОТП), блоки без детализации состава (МОТП)</comment>
  </enumValues>
  <enumValues>
    <name>ГрупповыеУпаковкиСПотребительскими</name>
    <comment>блоки и пачки (МОТП), блоки с детализацией состава - для видов продукции с групповыми товарными упаковками</comment>
  </enumValues>
  <enumValues>
    <name>ПотребительскиеУпаковки</name>
    <comment>Пачки (МОТП) - для видов продукции с групповыми товарными упаковками</comment>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <attributes>
    <name>ВариантЗаполненияДекларации</name>
    <type>
      <types>EnumRef.ВариантыЗаполненияДекларацииИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормированияАТКИСМП</name>
    <type>
      <types>EnumRef.ВариантыФормированияАТКИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДекларации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИмпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеМаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроисхожденияВЕТИССтрокой</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияНанесения</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводственнойЛинии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоеРешение</name>
    <type>
      <types>EnumRef.ПринятыеРешенияИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкоропортящаясяПродукцияВЕТИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаСертификации</name>
      <comment>Вид документа обязательной сертификации</comment>
      <type>
        <types>EnumRef.ВидыДокументовОбязательнойСертификацииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаСертификации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокументаСертификации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводства</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДекларации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидМаркировки</name>
      <type>
        <types>EnumRef.УдалитьВидыМаркировкиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПроисхожденияВЕТИС</name>
      <type>
        <types>DefinedType.ИдентификаторПроисхожденияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОтчетаПроизводственнойЛинии</name>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыАТК</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/CommonModules/ПроверкаИПодборПродукцииИСМПКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается при выполнении команды "ВозобновитьПроверку" из форм прикладных документов
//   в конфигурации - потребителе библиотеки ГосИС.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного документа, в который встраивается функциональность библиотеки ГосИС.
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции для возобновления проверки.
//  ПараметрыУказанияСерий - Произвольный - параметры указания серий источника для корректного отображения серий.
//
Процедура ВозобновитьПроверку(Форма, ВидМаркируемойПродукции, ПараметрыУказанияСерий) Экспорт
	
	ПараметрыОткрытияФормыПроверки = ПараметрыОткрытияФормыПроверкиИПодбора(Форма, ВидМаркируемойПродукции);
	
	ТребуетсяВопрос = Ложь;
	
	Если Форма.Модифицированность Тогда
		
		Если НЕ ПустаяСтрока(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект)
			И ПараметрыОткрытияФормыПроверки.ПроверятьМодифицированность Тогда
	
			Объект = Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект];
			
			ТребуетсяВопрос  = Истина;
			ПровестиЗаписать = ?(Объект.Проведен, НСтр("ru = 'Провести'"), НСтр("ru = 'Записать'"));
			ТекстВопроса     = СтрШаблон(НСтр("ru = 'Документ был изменен. %1?'"), ПровестиЗаписать);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяВопрос Тогда
		
		ПараметрыВопроса = Новый Структура();
		ПараметрыВопроса.Вставить("Форма", Форма);
		ПараметрыВопроса.Вставить("ПараметрыОткрытияФормыПроверки", ПараметрыОткрытияФормыПроверки);
		ПараметрыВопроса.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВозобновитьПроверкуИПодборПриОтветеНаВопрос",
			ЭтотОбъект, ПараметрыВопроса);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВозобновитьПроверкуОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму проверки и подбора маркируемой продукции
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Источник события
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
//  ПараметрыУказанияСерий - Произвольный - параметры указания серий источника для корректного отображения серий.
//
Процедура ОткрытьФормуПроверкиИПодбора(Форма, ВидМаркируемойПродукции, ПараметрыУказанияСерий) Экспорт
	
	ТребуетсяВопрос = Ложь;
	
	ПараметрыОткрытияФормыПроверки = ПараметрыОткрытияФормыПроверкиИПодбора(Форма, ВидМаркируемойПродукции);
	
	Если НЕ ПустаяСтрока(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект) Тогда
		Объект = Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект];

		Если НЕ ПараметрыОткрытияФормыПроверки.ПроверятьМодифицированность Тогда
		ИначеЕсли Объект.Ссылка.Пустая() Тогда
			ТребуетсяВопрос = Истина;
			ТекстВопроса    = НСтр("ru = 'Сканирование маркируемой продукции возможно только в записанном документе. Записать?'");
		ИначеЕсли Форма.Модифицированность Тогда
			ТребуетсяВопрос  = Истина;
			ПровестиЗаписать = ?(Объект.Проведен, НСтр("ru = 'Провести'"), НСтр("ru = 'Записать'"));
			ТекстВопроса     = СтрШаблон(НСтр("ru = 'Документ был изменен. %1?'"), ПровестиЗаписать);
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяВопрос Тогда
		
		ПараметрыВопроса = Новый Структура();
		ПараметрыВопроса.Вставить("Форма", Форма);
		ПараметрыВопроса.Вставить("ПараметрыОткрытияФормыПроверки", ПараметрыОткрытияФормыПроверки);
		ПараметрыВопроса.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуПроверкиИПодбораПриОтветеНаВопрос",
			ЭтотОбъект, ПараметрыВопроса);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
КонецПроцедуры

// Предназначена для открытия формы проверки и подбора маркируемой продукции
// 
// Параметры:
//   * Форма - ФормаКлиентскогоПриложения - форма прикладного документа или общая форма, в который встраивается
//       функциональность библиотеки ГосИС.
//   * ПараметрыОткрытияФормыПроверки - ПеречислениеСсылка.ВидыПродукцииИС - для получения параметров открытия из формы;
//                                    - Структура - (См. ПараметрыОткрытияФормыПроверкиИПодбора).
//                                    
//   * ПараметрыУказанияСерий - Произвольный - параметры указания серий источника для корректного отображения серий.
//
Процедура ОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, Знач ПараметрыОткрытияФормыПроверки, Знач ПараметрыУказанияСерий) Экспорт

	ОчиститьСообщения();
	
	Если ТипЗнч(ПараметрыОткрытияФормыПроверки) = Тип("ПеречислениеСсылка.ВидыПродукцииИС") Тогда
		ПараметрыОткрытияФормыПроверки = Форма.ПараметрыИнтеграцииГосИС.Получить(ПараметрыОткрытияФормыПроверки);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РедактированиеФормыНедоступно",        ПараметрыОткрытияФормыПроверки.РедактированиеФормыНедоступно);
	ПараметрыФормы.Вставить("ПроверятьНеобходимостьПеремаркировки", ПараметрыОткрытияФормыПроверки.ПроверятьНеобходимостьПеремаркировки);
	ПараметрыФормы.Вставить("РасчитыватьХешСуммуУпаковок",          ПараметрыОткрытияФормыПроверки.РасчитыватьХешСуммуУпаковок);
	ПараметрыФормы.Вставить("АдресПроверяемыхДанных",               ПараметрыОткрытияФормыПроверки.АдресПроверяемыхДанных);
	ПараметрыФормы.Вставить("ДоступнаПечатьЭтикеток",               ПараметрыОткрытияФормыПроверки.ДоступнаПечатьЭтикеток);
	ПараметрыФормы.Вставить("ДопустимыйСпособВводаВОборот",         ПараметрыОткрытияФормыПроверки.ДопустимыйСпособВводаВОборот);
	ПараметрыФормы.Вставить("ДанныеВыбораПоМаркируемойПродукции",   ПараметрыОткрытияФормыПроверки.ДанныеВыбораПоМаркируемойПродукции);
	ПараметрыФормы.Вставить("СохраненВыборПоМаркируемойПродукции",  ПараметрыОткрытияФормыПроверки.СохраненВыборПоМаркируемойПродукции);
	ПараметрыФормы.Вставить("ПроверкаЭлектронногоДокумента",        ПараметрыОткрытияФормыПроверки.ПроверкаЭлектронногоДокумента);
	ПараметрыФормы.Вставить("ДоступноСозданиеНовыхУпаковок",        ПараметрыОткрытияФормыПроверки.ДоступноСозданиеНовыхУпаковок);
	ПараметрыФормы.Вставить("ВидМаркируемойПродукции",              ПараметрыОткрытияФормыПроверки.ВидМаркируемойПродукции);
	ПараметрыФормы.Вставить("ИспользоватьСтатусПроверкаЗавершена",  ПараметрыОткрытияФормыПроверки.ИспользоватьСтатусПроверкаЗавершена);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",               ПараметрыУказанияСерий);
	
	Если ПустаяСтрока(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект) Тогда
		
		ПараметрыФормы.Вставить("Организация",             Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаОрганизация]);
		ПараметрыФормы.Вставить("ПроверкаНеПоДокументу",   Истина);
		ПараметрыФормы.Вставить("НачальныйСтатусПроверки", ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.ВНаличии"));
		ПараметрыФормы.Вставить("РежимПодбораСуществующихУпаковок", Истина);
		
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаСклад) Тогда
			ПараметрыФормы.Вставить("Склад", Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаСклад]);
		КонецЕсли;
	
	Иначе
		
		Объект = Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект];
		
		ПараметрыФормы.Вставить("ПроверяемыйДокумент", Объект.Ссылка);
		ПараметрыФормы.Вставить("Организация",         Объект[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаОрганизация]);
		
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаСклад) Тогда
			ПараметрыФормы.Вставить("Склад", Объект[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаСклад]);
		КонецЕсли;
		
		Если ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоЧекККМ(Форма)
		 Или ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоЧекККМВозврат(Форма) Тогда
			ПараметрыФормы.Вставить("ПроверкаНеПоДокументу",   Истина);
			ПараметрыФормы.Вставить("НачальныйСтатусПроверки", ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.ВНаличии"));
			ПараметрыФормы.Вставить("КонтролироватьСканируемуюПродукциюПоДокументуОснованию", Ложь);
		Иначе
			ПараметрыФормы.Вставить("ПроверкаНеПоДокументу",   Ложь);
			ПараметрыФормы.Вставить("НачальныйСтатусПроверки", ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.НеПроверялась"));
			
			Если НЕ ПустаяСтрока(ПараметрыОткрытияФормыПроверки.ИмяРеквизитаДокументОснование) Тогда
				ПараметрыФормы.Вставить("КонтролироватьСканируемуюПродукциюПоДокументуОснованию",
					ЗначениеЗаполнено(Объект[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаДокументОснование]));
			КонецЕсли;
		КонецЕсли;
		
		Если ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоДокументПриобретения(Форма) Тогда
			ПараметрыФормы.Вставить("ПриЗавершенииСохранятьРезультатыПроверки", Истина);
			ПараметрыФормы.Вставить("РежимПодбораСуществующихУпаковок",         Ложь);
		Иначе
			ПараметрыФормы.Вставить("ПриЗавершенииСохранятьРезультатыПроверки", Ложь);
			ПараметрыФормы.Вставить("РежимПодбораСуществующихУпаковок",         Истина);
		КонецЕсли;
		
		Если НЕ ПараметрыФормы.РежимПодбораСуществующихУпаковок Тогда
			ПараметрыФормы.Вставить("Контрагент", Объект[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаКонтрагент]);
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверкаИПодборПродукцииИСМПКлиентПереопределяемый.ПередОткрытиемФормыПроверкиПодбора(
		Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормы, Отказ);
	
	Если Отказ Тогда
		Возврат;
	Иначе
		Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ПараметрыОткрытияФормыПроверки.ВидМаркируемойПродукции) Тогда
			ИмяФормыПроверкиИПодбора = "Обработка.ПроверкаИПодборТабачнойПродукцииМОТП.Форма.ПроверкаИПодбор";
		ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоПродукцияИСМП(ПараметрыОткрытияФормыПроверки.ВидМаркируемойПродукции) Тогда
			ИмяФормыПроверкиИПодбора = "Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ПроверкаИПодбор";
		Иначе
			ТекстОшибки = НСтр("ru = 'Для маркируемой продукции ""%1"" проверка и подбор в отдельной форме не предусмотрен.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ПараметрыОткрытияФормыПроверки.ВидМаркируемойПродукции);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;

		ОткрытьФорму(ИмяФормыПроверкиИПодбора,
			ПараметрыФормы,
			Форма,
			Форма.УникальныйИдентификатор, , ,
			ПараметрыОткрытияФормыПроверки.ОписаниеОповещенияПриЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// Предназначена для открытия формы проверки и подбора маркируемой продукции в режиме возобновления проверки
// 
// Параметры:
// 	 * Форма - ФормаКлиентскогоПриложения - форма прикладного документа или общая форма, в который встраивается функциональность библиотеки ГосИС:
// 	 * ПараметрыОткрытияФормыПроверки - См. ПараметрыОткрытияФормыПроверкиИПодбора.
//   * ПараметрыУказанияСерий - Произвольный - параметры указания серий источника для корректного отображения серий.
//
Процедура ВозобновитьПроверкуОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий) Экспорт
	
	Если ПроверкаИПодборПродукцииИСМПВызовСервера.ВозобновитьПроверкуПоДокументу(
		Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект].Ссылка,
		ПараметрыОткрытияФормыПроверки.ВидМаркируемойПродукции) Тогда
		
		Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.МаркировкаТоваровИСМП")
			Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ВыводИзОборотаИСМП")
			Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.СписаниеКодовМаркировкиИСМП")
			Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПриемкаТоваровИСМП")
			Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтгрузкаТоваровИСМП") Тогда
			Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Выполняется");
			ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытияФормыПроверки);
		КонецЕсли;
		
		ОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Серии

// Готовит данные для генерации серий
// 
// Параметры:
// 	ПодобраннаяМаркируемаяПродукция - ТаблицаЗначений - таблица подобранной маркируемой продукции.
// Возвращаемое значение:
// 	Массив - содержит структуры (См. ИнтеграцияИСМПУТКлиентСервер.СтруктураДанныхДляГенерацииСерии)
//
Функция ДанныеДляГенерацииСерийПоПодобраннойПродукции(ТаблицаПродукции, ВидМаркируемойПродукции, ИмяКолонкиКоличество = "КоличествоПодобрано") Экспорт
	
	ДанныеДляГенерации = Новый Массив;
	
	СтатусыСерийСерияНеУказана    = ПроверкаИПодборПродукцииИСМПКлиентСервер.СтатусыСерийСерияНеУказана();
	СтатусыСерийСериюМожноУказать = ПроверкаИПодборПродукцииИСМПКлиентСервер.СтатусыСерийСериюМожноУказать();
	
	Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
		
		Если СтрокаПродукции[ИмяКолонкиКоличество] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтатусыСерийСерияНеУказана.Найти(СтрокаПродукции.СтатусУказанияСерий) <> Неопределено
			Или СтатусыСерийСериюМожноУказать.Найти(СтрокаПродукции.СтатусУказанияСерий) <> Неопределено Тогда
			
			ДанныеПоСтроке = СтруктураДанныхДляГенерацииСерии(ВидМаркируемойПродукции);
			ЗаполнитьЗначенияСвойств(ДанныеПоСтроке, СтрокаПродукции);
			
			ДанныеСерииСуществуют = Ложь;
			
			Для Каждого ДанныеСерии Из ДанныеДляГенерации Цикл
				ДанныеСерииСовпадают = Истина;
				
				Для Каждого КлючИЗначение Из ДанныеПоСтроке Цикл
					ДанныеСерииСовпадают = ДанныеСерииСовпадают И (ДанныеСерии[КлючИЗначение.Ключ] = КлючИЗначение.Значение);
					Если НЕ ДанныеСерииСовпадают Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ДанныеСерииСовпадают Тогда
					ДанныеСерииСуществуют = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ДанныеСерииСуществуют Тогда
				ДанныеДляГенерации.Добавить(ДанныеПоСтроке);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДляГенерации;

КонецФункции

Процедура ЗаполнитьСерииВПодобраннойМаркируемойПродукции(Форма, ДанныеСерий, ТаблицаПродукции) Экспорт
	
	Для Каждого ДанныеСерии Из ДанныеСерий Цикл
		Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
			Если ЗначениеЗаполнено(СтрокаПродукции.Серия) Тогда
				Продолжить;
			КонецЕсли;
			
			КлючевыеЗначенияСовпадают = Истина;
			
			Для Каждого КлючИЗначение Из ДанныеСерии Цикл
				Если КлючИЗначение.Ключ = "Серия" Тогда
					Продолжить;
				ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаПродукции, КлючИЗначение.Ключ) Тогда
					Продолжить;
				КонецЕсли;
				
				КлючевыеЗначенияСовпадают = КлючевыеЗначенияСовпадают
					И (СтрокаПродукции[КлючИЗначение.Ключ] = КлючИЗначение.Значение);
				
				Если НЕ КлючевыеЗначенияСовпадают Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если КлючевыеЗначенияСовпадают Тогда
				Если ДанныеСерии.ЕстьОшибка Тогда
					
					ТекстСообщения = СтрШаблон(
						НСтр("ru = 'В строке %1 произошла ошибка при создании серии по причине %2'"),
						СтрокаПродукции.НомерСтроки,
						ДанныеСерии.ТекстОшибки);
					
					ИмяПоля = Форма.ПараметрыУказанияСерий.ИмяТЧСерии + "["
						+ ТаблицаПродукции.Индекс(СтрокаПродукции)
						+ "].Серия";
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяПоля);
					
				Иначе
					
					СтрокаПродукции.Серия = ДанныеСерии.Серия;
					
					СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииСерии(Форма,
						СтрокаПродукции, Неопределено, Форма.ПараметрыУказанияСерий);
						
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Подготовливает структуру, массив которых в дальнейшем будет передан в процедуру генерации серий.
// 
// Параметры:
// Возвращаемое значение:
// 	Структура - Описание:
// * Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура, для которой будет генерироваться серия.
// * Серия        - ОпределяемыйТип.СерияНоменклатуры   - В данное значение будет записана сгенерированная серия.
// * ЕстьОшибка   - Булево - Будет установлено в Истина, если по каким то причинам серия сгенерирована не будет.
// * ТекстОшибки  - Строка - причина, по которой серия не генерировалась.
// * МРЦ          - Число - только для табачной продукции, максимальная розничная цена.
//
Функция СтруктураДанныхДляГенерацииСерии(ВидМаркируемойПродукции) Экспорт
	
	СтруктураДанных = Новый Структура();
	
	ПроверкаИПодборПродукцииИСМПКлиентПереопределяемый.ПолучитьДанныеДляГенерацииСерии(СтруктураДанных, ВидМаркируемойПродукции);
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область РасчетХешСумм

// Пересчитывает хеш-суммы всех упаковок формы. На клиенте формируется структура для расчета, на сервере
// вычисляются хеш-суммы и проверяется необходимость перемаркировки.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма проверки и подбора маркируемой продкуции.
//
Процедура ПересчитатьХешСуммыВсехУпаковок(Форма) Экспорт

	Если НЕ Форма.РасчитыватьХешСуммуУпаковок Тогда
		Возврат;
	КонецЕсли;

	Если Форма.ДетализацияСтруктурыХранения = ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки") Тогда
		Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = 0;
		ПроверкаИПодборПродукцииИСМПКлиентСервер.ОтобразитьИнформациюОНеобходимостиПеремаркировки(Форма);
		Возврат;
	КонецЕсли;
	
	ЗначенияСтрокДерева = Новый Массив();
	
	ПроверкаИПодборПродукцииИСКлиент.ЗаполнитьЗначенияСтрокДереваДляРасчетаХешСумм(ЗначенияСтрокДерева, Форма.ДеревоМаркированнойПродукции.ПолучитьЭлементы());

	ТаблицаПеремаркировки = ПроверкаИПодборПродукцииИСМПВызовСервера.ПересчитатьХешСуммыВсехУпаковок(ЗначенияСтрокДерева);
	
	ПроверкаИПодборПродукцииИСКлиент.ЗаполнитьХешСуммыВСтрокахДереваУпаковок(ЗначенияСтрокДерева, Форма.ДеревоМаркированнойПродукции);
	
	ПроверкаИПодборПродукцииИСМПКлиентСервер.ПроверитьНеобходимостьПеремаркировки(Форма, ТаблицаПеремаркировки, Ложь);
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработатьИзменениеНоменклатурыВСтроке(Форма, СтрокаАгрегатор) Экспорт
	КэшированныеЗначения = Неопределено;
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииНоменклатуры(Форма, СтрокаАгрегатор, КэшированныеЗначения, Форма.ПараметрыУказанияСерий);
КонецПроцедуры

Процедура ОбработатьИзменениеКоличестваВСтроке(Форма, СтрокаАгрегатор) Экспорт
	КэшированныеЗначения = Неопределено;
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииКоличества(Форма, СтрокаАгрегатор, КэшированныеЗначения, Форма.ПараметрыУказанияСерий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Предназначена для установки параметров открытия формы проверки и подбора маркируемой продукции
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма прикладного документа или общая форма, в который встраивается функциональность библиотеки ГосИС:
// Возвращаемое значение:
//  Структура - значения, используемые для управления открытием формы проверки и подбора:
//  * ИмяРеквизитаФормыОбъект              - Строка - имя реквизита формы документа, содержащего объект документа. Для открытия не из формы документа должен быть пустой строкой
//  * ИмяРеквизитаОрганизация              - Строка - имя реквизита документа или реквизита формы, содержащего организацию
//  * ИмяРеквизитаКонтрагент               - Строка - имя реквизита документа или реквизита формы, содержащего контрагента
//  * ИмяРеквизитаСклад                    - Строка - имя реквизита документа или реквизита формы, содержащего склад
//  * ИмяРеквизитаДокументОснование        - Строка - имя реквизита документа, содержащего его основание. Если основания нет, должен быть пустой строкой.
//  * ПроверятьНеобходимостьПеремаркировки - Булево - признак необходимости контроля состава упаковок в форме проверки.
//  * РасчитыватьХешСуммуУпаковок          - Булево - признак необходимости расчета хеш-сумм упаковок.
//  * РедактированиеФормыНедоступно        - Булево - признак недоступности редактирования формы, из которой открывается форма проверки
//  * АдресПроверяемыхДанных               - Строка - адрес данных для загрузки в форму проверки, если передача данных происходит не через ссылку на документ
//  * ОписаниеОповещенияПриЗакрытии        - ОписаниеОповещения - описание процедуры, которая будет вызвана после закрытия формы проверки
//  * ПроверятьМодифицированность          - Булево - признак необходимости записи документа перед открытием формы проверки
//  * ВидМаркируемойПродукции              - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции, для проверки которого будет открыта форма
//  * ПроверкаЭлектронногоДокумента        - Булево - признак режима проверки входящего электронного документа
//
Функция ПараметрыОткрытияФормыПроверкиИПодбора(Форма, ВидМаркируемойПродукции)
	
	// В документах подсистемы ИС МП параметры интеграции могут быть не встроены,
	// например в документе СписаниеКодовМаркировкиИСМП
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		ПараметрыИнтеграции = Форма.ПараметрыИнтеграцииГосИС.Получить(ВидМаркируемойПродукции);
		ИспользоватьСтатусПроверкаЗавершена = ПараметрыИнтеграции.ИспользоватьСтатусПроверкаЗавершена;
	Иначе
		ИспользоватьСтатусПроверкаЗавершена = Неопределено;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяРеквизитаФормыОбъект",             "Объект");
	ПараметрыОткрытия.Вставить("ИмяРеквизитаОрганизация",             "Организация");
	ПараметрыОткрытия.Вставить("ИмяРеквизитаКонтрагент",              "Контрагент");
	ПараметрыОткрытия.Вставить("ИмяРеквизитаСклад",                   "Склад");
	ПараметрыОткрытия.Вставить("ИмяРеквизитаДокументОснование",       "ДокументОснование");
	ПараметрыОткрытия.Вставить("ПроверятьНеобходимостьПеремаркировки", Истина);
	ПараметрыОткрытия.Вставить("РасчитыватьХешСуммуУпаковок",          Истина);
	ПараметрыОткрытия.Вставить("РедактированиеФормыНедоступно",        Ложь);
	ПараметрыОткрытия.Вставить("АдресПроверяемыхДанных",               "");
	ПараметрыОткрытия.Вставить("ПроверятьМодифицированность",          Истина);
	ПараметрыОткрытия.Вставить("ПроверкаЭлектронногоДокумента",        Ложь);
	ПараметрыОткрытия.Вставить("ДоступнаПечатьЭтикеток",               Ложь);
	ПараметрыОткрытия.Вставить("ДопустимыйСпособВводаВОборот",         Неопределено);
	ПараметрыОткрытия.Вставить("ДанныеВыбораПоМаркируемойПродукции",   Неопределено);
	ПараметрыОткрытия.Вставить("СохраненВыборПоМаркируемойПродукции",  Неопределено);
	ПараметрыОткрытия.Вставить("ДоступноСозданиеНовыхУпаковок",        Ложь);
	ПараметрыОткрытия.Вставить("ИспользоватьСтатусПроверкаЗавершена",  ИспользоватьСтатусПроверкаЗавершена);
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВидМаркируемойПродукции", ВидМаркируемойПродукции);
	ПараметрыЗакрытия.Вставить("Форма",                   Форма);
	
	ОповещениеПриЗакрытии = Новый ОписаниеОповещения(
		"ПриЗакрытииФормыПроверкиИПодбора",
		ЭтотОбъект, ПараметрыЗакрытия);
	
	ПараметрыОткрытия.Вставить("ОписаниеОповещенияПриЗакрытии", ОповещениеПриЗакрытии);
	ПараметрыОткрытия.Вставить("ВидМаркируемойПродукции",       ВидМаркируемойПродукции);
	
	ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

Процедура ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия)
	
	Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ПараметрыОткрытия.ВидМаркируемойПродукции) Тогда
		ПараметрыОткрытия.ПроверятьНеобходимостьПеремаркировки = Ложь;
		ПараметрыОткрытия.РасчитыватьХешСуммуУпаковок          = Ложь;
	КонецЕсли;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.МаркировкаТоваровИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаКонтрагент               = "Контрагент";
		ПараметрыОткрытия.ИмяРеквизитаСклад                    = Неопределено;
		ПараметрыОткрытия.ДоступнаПечатьЭтикеток               = Истина;
		ПараметрыОткрытия.ПроверятьНеобходимостьПеремаркировки = Ложь;
		ПараметрыОткрытия.ДоступноСозданиеНовыхУпаковок        = Истина;
		ПараметрыОткрытия.ДопустимыйСпособВводаВОборот         =
			ШтрихкодированиеИСМПКлиентСервер.СпособВводаВОборотСУЗПоВидуОперации(Форма.Объект.Операция);
		ПараметрыОткрытия.ДанныеВыбораПоМаркируемойПродукции   = Форма.ДанныеВыбораПоМаркируемойПродукции;
		ПараметрыОткрытия.СохраненВыборПоМаркируемойПродукции  = Форма.СохраненВыборПоМаркируемойПродукции;
		ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия);
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ВыводИзОборотаИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаСклад = Неопределено;
		ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия);
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.СписаниеКодовМаркировкиИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаСклад = Неопределено;
		ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия);
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПеремаркировкаТоваровИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаСклад = Неопределено;
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтгрузкаТоваровИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаСклад = Неопределено;
		ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия);
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПриемкаТоваровИСМП") Тогда
		ПараметрыОткрытия.ИмяРеквизитаСклад = Неопределено;
		ПараметрыОткрытия.ПроверятьНеобходимостьПеремаркировки = Ложь;
		ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия);
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИСМПКлиентПереопределяемый.ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия);
	
КонецПроцедуры

Процедура ОпределитьДоступностьФормыПроверкиИподбора(Форма, ПараметрыОткрытия)
	
	Если Форма.РедактированиеФормыНеДоступно Тогда
		ПараметрыОткрытия.РедактированиеФормыНедоступно = Истина;
	ИначеЕсли Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Завершено") Тогда
		ПараметрыОткрытия.РедактированиеФормыНедоступно = Истина;
	Иначе
		ПараметрыОткрытия.РедактированиеФормыНедоступно = НЕ Форма.ПравоИзменения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуПроверкиИПодбораПриОтветеНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыОткрытияФормыПроверки = ДополнительныеПараметры.ПараметрыОткрытияФормыПроверки;
	
	Объект = Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект];
	
	СтандартнаяОбработка = Ложь;
	ДействиеПослеЗаписи = Новый ОписаниеОповещения("ОткрытьФормуПроверкиИПодбораПослеЗаписиОбъекта", ЭтотОбъект, ДополнительныеПараметры);
	ИнтеграцияИСКлиентПереопределяемый.ВыполнитьЗаписьОбъектаВФорме(Форма, Объект, ДействиеПослеЗаписи, СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаписи = Ложь;
	Если Объект.Проведен Тогда
		Если Форма.ПроверитьЗаполнение() Тогда
			РезультатЗаписи = Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
	Иначе
		РезультатЗаписи = Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, РезультатЗаписи);
	
КонецПроцедуры

Процедура ОткрытьФормуПроверкиИПодбораПослеЗаписиОбъекта(РезультатЗаписи, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатЗаписи Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыОткрытияФормыПроверки = ДополнительныеПараметры.ПараметрыОткрытияФормыПроверки;
	ПараметрыУказанияСерий = ДополнительныеПараметры.ПараметрыУказанияСерий;
	ОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий);
	
КонецПроцедуры

Процедура ВозобновитьПроверкуИПодборПриОтветеНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыОткрытияФормыПроверки = ДополнительныеПараметры.ПараметрыОткрытияФормыПроверки;
	ПараметрыУказанияСерий = ДополнительныеПараметры.ПараметрыУказанияСерий;
	Объект = Форма[ПараметрыОткрытияФормыПроверки.ИмяРеквизитаФормыОбъект];
		
	ЗаписаноУспешно = Ложь;
	
	Если Объект.Проведен Тогда
		Если Форма.ПроверитьЗаполнение() Тогда
			ЗаписаноУспешно = Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
	Иначе
		ЗаписаноУспешно = Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;

	Если ЗаписаноУспешно Тогда
		ВозобновитьПроверкуОткрытьФормуПроверкиИПодбораМаркируемойПродукции(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыУказанияСерий);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗакрытииФормыПроверкиИПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПроверкаИПодборПродукцииИСМПКлиентПереопределяемый.ПриЗакрытииФормыПроверкиИПодбора(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ЕстьРасхожденияПоРезультатамПроверкиИПодбора(ПодобраннаяМаркируемаяПродукция) Экспорт
	
	Для Каждого СтрокаПодобраннойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		
		Если СтрокаПодобраннойПродукции.Количество <> СтрокаПодобраннойПродукции.КоличествоПодобрано Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	 
	Возврат Ложь;
	
КонецФункции

#Область ТипыШтрихкодов

Функция ДоступныеТипыШтрихкодовСтрокой() Экспорт
	
	ДоступныеТипы = Новый СписокЗначений();
	
	ДоступныеТипы.Добавить("GS1128");
	ДоступныеТипы.Добавить("SSCC");
	
	Возврат ДоступныеТипы;
	
КонецФункции

#КонецОбласти

#КонецОбласти
